<?php
function SP ($key)
{
    global $site_lang, $Ps;
    return $Ps[strtolower($key)][strtolower($site_lang)];
}
function P ($key)
{
    echo SP($key);
}
$Ps = [
    "site title" => [
	"ckb" => "کتێبخانە",
	"fa" => "کتاب‌خانه",
	"en" => "Library",
    ],
    "send" => [
	"ckb" => "گەڕان",
	"fa" => "جست‌وجو",
	"en" => "Search",
    ],
    "more" => [
	"ckb" => "زیاتر",
	"fa" => "بیشتر",
	"en" => "more",
    ],
    "less" => [
	"ckb" => "کەمتر",
	"fa" => "کمتر",
	"en" => "less",
    ],
    "not found" => [
	"ckb" => "بەداخەوە گەڕان هیچ ئاکامی نەبوو.",
	"fa" => "متاسفانه نتیجه‌ای یافت نشد.",
	"en" => "Sorry, no results found.",
    ],
    "empty error" => [
	"ckb" => "تکایە تەنانەت یەکێک لە فیلدەکانی سەرەوە پڕ کەنەوە.",
	"fa" => "لطفا حداقل یکی از فیلدهای بالا را پر کنید.",
	"en" => "Please, fill in one of the above fields at least.",
    ],
    "site lang" => [
	"ckb" => "کوردی",
	"fa" => "فارسی",
	"en" => "English",
    ],
    "persian books" => [
	"ckb" => "کتێبە فارسییەکان",
	"fa" => "کتاب‌های فارسی",
	"en" => "Persian books",
    ],
    "english books" => [
	"ckb" => "کتێبە ئینگلیسیەکان",
	"fa" => "کتاب‌های انگلیسی",
	"en" => "English books",
    ],
    "search in" => [
	"ckb" => "گەڕان لە",
	"fa" => "جست‌وجو در",
	"en" => "Search in",
    ],
    "number of results" => [
	"ckb" => "ئەژماری ئاکامەکان",
	"fa" => "تعداد نتایج",
	"en" => "Number of results",
    ],
    "ردیف" => [
	"ckb" => "ڕەدیف",
	"fa" => "ردیف",
	"en" => "Id",
    ],
    "پديدآور" => [
	"ckb" => "نووسەر",
	"fa" => "نویسنده",
	"en" => "Writer",
    ],
    "عنوان‏" => [
	"ckb" => "ناوی کتێب",
	"fa" => "نام کتاب",
	"en" => "Book title",
    ],
    "زبان‏" => [
	"ckb" => "زمان",
	"fa" => "زبان",
	"en" => "Language",
    ],
    "شماره_راهنما_(کنگره)‏" => [
	"ckb" => "ژمارەی ڕەدەبەندی کۆنگرە",
	"fa" => "شماره رده‌بندی کنگره",
	"en" => "Library of congress classification number",
    ],
    "شماره_راهنما_(ديويي)‏" => [
	"ckb" => "ژمارەی دێوێی",
	"fa" => "شماره دیویی",
	"en" => "Dewey decimal classification number",
    ],
    "شماره_مدرک‏" => [
	"ckb" => "",
	"fa" => "شماره مدرک",
	"en" => "",
    ],
    "نوع_سرشناسه‏" => [
	"ckb" => "",
	"fa" => "نوع سرشناسه",
	"en" => "",
    ],
    "شرح_پديدآور‏" => [
	"ckb" => "سەبارەت بە نووسەر",
	"fa" => "شرح نویسنده",
	"en" => "",
    ],
    "وضعيت_نشر‏" => [
	"ckb" => "",
	"fa" => "وضعیت نشر",
	"en" => "",
    ],
    "سال_نشر‏" => [
	"ckb" => "",
	"fa" => "سال نشر",
	"en" => "",
    ],
    "مشخصات_ظاهري‏" => [
	"ckb" => "",
	"fa" => "مشخصات ظاهری",
	"en" => "",
    ],
    "فروست‏" => [
	"ckb" => "",
	"fa" => "فروست",
	"en" => "",
    ],
    "يادداشت‏" => [
	"ckb" => "یاداشت",
	"fa" => "یادداشت",
	"en" => "Notes",
    ],
    "مندرجات‏" => [
	"ckb" => "",
	"fa" => "مندرجات",
	"en" => "",
    ],
    "موضوع‏" => [
	"ckb" => "بابەت",
	"fa" => "موضوع",
	"en" => "Subject",
    ],
    "شناسه_افزوده‏" => [
	"ckb" => "",
	"fa" => "شناسه افزوده",
	"en" => "",
    ],
    "موجودي_فيزيکي‏" => [
	"ckb" => "",
	"fa" => "موجودی فیزیکی",
	"en" => "",
    ],
    "ويرايش‏" => [
	"ckb" => "نڤیسیاری",
	"fa" => "ویرایش",
	"en" => "Edit",
    ],
    "عنوان_قراردادي‏" => [
	"ckb" => "",
	"fa" => "عنوان قراردادی",
	"en" => "",
    ],
    "شابک_مجموعه‏" => [
	"ckb" => "",
	"fa" => "شابک مجموعه",
	"en" => "",
    ],
    "مرجع‏" => [
	"ckb" => "",
	"fa" => "مرجع",
	"en" => "Reference",
    ],
    "عناوين_ديگر‏" => [
	"ckb" => "عینوانەکانی‌تر",
	"fa" => "عناوین دیگر",
	"en" => "Other titles",
    ],
    /* English columns */
    "id" => [
	"ckb" => "ڕەدیف",
	"fa" => "ردیف",
	"en" => "Id",
    ],
];
?>
